import image9 from '../image/image9.png'
import image10 from '../image/image10.png'
import image11 from '../image/image11.png'
import image12 from '../image/image12.png'
const postData = [
    {
        id: 1,
        sex: 'boy',
        name: '野原二支柱',
        type: '感情',
        title: '抱睡到底是殺小？',
        desc: `求問，不知道是不是我年紀大了（25歲） 這幾天剛把很久沒用的低卡下載回來，才發現一堆抱睡文章。現在年輕人（大學生們）真的都流行在曖昧期間抱睡嗎？ 我那個年代睡一起都馬直接色色了⋯⋯
        `,
        likecount: 1234,
        favorite: false,
        date: '2022/10/28',
        msg: [
            {
                id: 1,
                sex: 'girl',
                name: '橋本環球',
                time: '2022/11/01',
                desc: `每年五月要抱睡`
            },
            {
                id: 2,
                sex: 'boy',
                name: '月島',
                time: '2022/10/28',
                desc: `可能只是想要心靈上的慰藉加上關係還沒有親密到色色`
            },
            {
                id: 3,
                sex: 'gril',
                name: '鯊大哥',
                time: '2022/10/27',
                desc: `我都跟鯊鯊抱睡`
            },
        ],
        photo: image9
    },
    {
        id: 2,
        sex: 'boy',
        name: '綠谷入九',
        type: '梗圖',
        title: '今天叫的uber好像哪裡怪怪的',
        desc: ``,
        likecount: 6577,
        // favorite: false,
        date: '2022/10/15',
        msg: [
            {
                id: 1,
                sex: 'boy',
                name: '屏科大大',
                time: '2022/10/28',
                desc: `這位uber司機的家很大，而且很熱情的歡迎你去`
            },
            {
                id: 2,
                sex: 'boy',
                name: '傑哥不要',
                time: '2022/10/27',
                desc: `載杰男逃`
            },
        ],
        photo: image10,
    },
    {
        id: 3,
        sex: 'girl',
        name: '蝴蝶忍受不了',
        type: '心情',
        title: '跳樓的人可能是我',
        desc: `我們學校最近有人跳樓了她選的那個地點，我在相同的地方徘徊過後來打不開窗戶才離開的如果當初窗戶沒有鎖起來，死掉的就是我了我們學校的輔導中心大排長龍，我也不信宗教醫院的精神科永遠都是掛滿，每個人只能進去拿個藥就走，小診所自費看診貴到付錢的手都會發抖我只是一個沒有能力賺錢的文組垃圾，滿20歲了還跟家裡拿錢去諮商好不要臉回到第一段，那個地點應該是輔大裡少數高於七樓又隱密的地方不知道學校會不會把那邊能讓人爬出去的窗戶全都封起來好想死啊死掉之前自由的飛行一次，感覺應該很好最後恭喜學姐脫離痛苦，不痛了，不疲倦了，解脫了也祝大家都早點解脫`,
        likecount: 193,
        favorite: true,
        date: '2022/10/20',
        msg: [
            {
                id: 1,
                sex: 'girl',
                name: '小天使',
                time: '2022/10/28',
                desc: `分享一個我看過最完美的自殺方式：
                1.洗一個熱水澡
                2.泡一杯熱牛奶，加點蜂蜜
                3.把空調開到舒適的溫度
                【建議是23℃，這個溫度能加速死亡】
                4.喝下牛奶，躺到床上，然後做一個甜甜的美夢
                5.等你睜開眼看見太陽升起就是你已經死了並輪回啦，用新身份
                新心情去重新活吧噓~只是孟婆搞錯，不小心讓你的下一世和上
                一世有點像而已哦 (●'◡'●)ﾉ 
                最後我想說，你辛苦了，也真的很努力了，你真的很棒了
                ps.只是希望原po看到能稍微的開心一點
                  （這方法很唬爛我知道）`
            },
            {
                id: 2,
                sex: 'boy',
                name: '暖男',
                time: '2022/10/27',
                desc: `我們學校前兩天也有一起，很心痛！妳千萬不要跳，如果諮詢有用，哥幫妳付自費看診的費用，完全沒有任何企圖，純粹不想看到年輕的生命消逝`
            },
        ],
    },
    {
        id: 4,
        sex: 'girl',
        name: '五臟',
        type: '感情',
        title: '千萬不要在疫情期間找男友！',
        desc: `在這戴口罩的時代 都不知道口罩底下那張臉長怎樣 小女子的男友（馬上要變前男友了） 戴上口罩感覺是很普通的人 我在喝醉酒的狀況下跟他在一起 隔天才第一次看到他的整張臉.. 那一瞬間我整個嚇傻`,
        likecount: 570,
        // favorite: true,
        date: '2022/10/21',
        msg: [
            {
                id: 1,
                sex: 'girl',
                name: '阿彌陀佛',
                time: '2022/10/28',
                desc: `ㄏㄏ看你在喝醉的情況下就跟別人交往可想而知`
            },
            {
                id: 2,
                sex: 'boy',
                name: 'ㄏㄏ',
                time: '2022/11/1',
                desc: `是不是連叫什麼名字都不知道就交往了`
            },
            
        ],
        
    },
    {
        id: 5,
        sex: 'boy',
        name: '江戶川科北',
        type: '心情',
        title: '看梨泰院新聞，全世界只有台灣戴口罩',
        desc: `看到梨泰院人擠人真的好可怕啊結果看到一個更令人震撼的事是沒人戴口罩`,
        likecount: 610,
        // favorite: true,
        date: '2022/10/25',
        msg: [
            {
                id: 1,
                sex: 'girl',
                name: '西門町',
                time: '2022/10/28',
                desc: `這種悲劇你也可以扯到口罩、政治，真的很傻眼欸…`
            },
            {
                id: 2,
                sex: 'boy',
                name: 'ㄏㄏ',
                time: '2022/10/27',
                desc: `日本也還是戴著啊，韓國解禁口罩多久了你知道嗎`
            },
            
        ],
        photo: image11
    },
    {
        id: 6,
        sex: 'boy',
        name: '工藤新八',
        type: '梗圖',
        title: '欸確實',
        desc: ``,
        likecount: 2492,
        // favorite: true,
        date: '2022/10/27',
        msg: [
            {
                id: 1,
                sex: 'girl',
                name: '意守辣妹',
                time: '2022/10/28',
                desc: `不要再留言了 我聽不香水的味道`
            },
            {
                id: 2,
                sex: 'boy',
                name: '鏈鋸高手',
                time: '2022/10/27',
                desc: `這裡的網路不好，我聞不到你的香水味`
            },
            {
                id: 3,
                sex: 'boy',
                name: '淡淡的哀傷',
                time: '2022/10/29',
                desc: `可以切一段下來寄給我聞一下嗎`
            },
            {
                id: 4,
                sex: 'boy',
                name: '醫術精明',
                time: '2022/10/27',
                desc: `胡說 明明就要調高亮度`
            },
        ],
        photo: image12
    },
]

export default postData

